Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Use a diff tool to inspect all changes.
ja_jp: diffツールを使って、すべての変更を検査します。

source: Use a distribution summary to record a value, not time. Use one of the following methods to create a distribution summary.
ja_jp: ディストリビューションサマリーを使用して、時間ではなく値を記録します。 ディストリビューションサマリーを作成するには、次のいずれかの方法を使用します。

source: Use a high level language that could cope with algorithm complexity.
ja_jp: アルゴリズムの複雑さに対応できる高レベルの言語の使用

source: Use a proper Wiremock version. View all link:https://central.sonatype.com/artifact/org.wiremock/wiremock?smo=true[available WireMock versions] on Maven Central.
ja_jp: 適切な Wiremock バージョンを使用してください。Maven Central で link:https://central.sonatype.com/artifact/org.wiremock/wiremock?smo=true[利用可能なすべての WireMock バージョン] を参照してください。

source: Use a proper Wiremock version. All available versions can be found link:https://search.maven.org/artifact/com.github.tomakehurst/wiremock-jre8[here].
ja_jp: 適切なWiremockのバージョンを使用してください。利用可能なすべてのバージョンは link:https://search.maven.org/artifact/com.github.tomakehurst/wiremock-jre8[ここ] で 見つけることができます。

source: Use a proper Wiremock version. All available versions can be found link:https://search.maven.org/artifact/org.wiremock/wiremock[here].
ja_jp: 適切なWiremockバージョンを使用してください。利用可能なすべてのバージョンは、 link:https://search.maven.org/artifact/org.wiremock/wiremock[こちら] をご覧ください。

source: Use a recent JBang version
ja_jp: 最近の JBang バージョンを使用する

source: Use a secure connection (e.g. HTTPS)
ja_jp: 安全な接続の使用（例：HTTPS）

source: Use a specific `native` profile for native executable building.
ja_jp: ネイティブ実行可能ファイルのビルドには、特定の `native` プロファイルを使用します。

source: Use a suffix that reflects the document type (optional):
ja_jp: ドキュメントの種類を反映する接尾辞を使用します (オプション)。

source: Use a unified configuration model to define data sources for Java Database Connectivity (JDBC) and Reactive drivers.
ja_jp: 統一された設定モデルを使用して、Java Database Connectivity (JDBC) および Reactive ドライバのデータソースを定義します。

source: Use a unique path `/[unique]` for your REST paths
ja_jp: RESTのパスには、ユニークなパス `/[unique]` を使用してください。

source: Use an `Optional<MetricsCapabilityBuildItem> metricsCapability` parameter to test which metrics API is supported (e.g. "micrometer") in your build step, and use that to selectively declare or initialize API-specific beans or build items.
ja_jp: `Optional<MetricsCapabilityBuildItem> metricsCapability` パラメーターを使用して、ビルドステップでどのメトリクス API (例: "micrometer") がサポートされているかをテストし、それを使用して API 固有の Bean またはビルドアイテムを選択的に宣言または初期化します。

source: Use an `Optional<MetricsCapabilityBuildItem> metricsCapability` parameter to test which metrics API is supported (e.g. "smallrye-metrics" or "micrometer") in your build step, and use that to selectively declare or initialize API-specific beans or build items.
ja_jp: `Optional<MetricsCapabilityBuildItem> metricsCapability` パラメーターを使用して、ビルドステップでサポートされているメトリクス API (smallrye-metrics や micrometer など) をテストし、それを使用して API 固有の Bean またはビルドアイテムを選択的に宣言または初期化します。

source: Use an active record or repository pattern with MongoDB
ja_jp: MongoDB でアクティブレコードまたはリポジトリーパターンを使用

source: Use anchors to cross-reference in-file and cross-file content
ja_jp: アンカーを使用したファイル内およびファイル間のコンテンツの相互参照

source: Use annotations to enable inclusive path-based authentication for Jakarta REST endpoints
ja_jp: アノテーションを使用して Jakarta REST エンドポイントの統合パスベース認証を有効にする

source: Use annotations to enable path-based authentication for Jakarta REST endpoints
ja_jp: アノテーションを使用して Jakarta REST エンドポイントのパスベース認証を有効にする

source: Use another test runner that starts the application from the native file before the tests. The executable is retrieved by the _Failsafe Maven Plugin_.
ja_jp: テストの前にネイティブファイルからアプリケーションを起動する別のテストランナーを使用します。実行可能ファイルは、_Failsafe Maven Plugin_ によって取得されます。

source: Use another test runner that starts the application from the native file before the tests. The executable is retrieved using the `native.image.path` system property configured in the _Failsafe Maven Plugin_.
ja_jp: テストの前にネイティブ ファイルからアプリケーションを起動する別のテスト ランナーを使用します。実行ファイルは、 _Failsafe Maven プラグイン_ で構成された `native.image.path` システム プロパティーを使用して取得されます。

source: Use any Qute template to display the data, for example, `qute-jokes-template.html`:
ja_jp: データを表示するには、任意の Qute テンプレートを使用します (例: `qute-jokes-template.html`)。

source: Use cases/configuration options
ja_jp: ユースケースおよび設定オプション

source: Use codecs
ja_jp: コーデックの使用

source: Use common text to describe how to create a project
ja_jp: 共通テキストを使用して、プロジェクトの作成方法を説明します。

source: Use dependency injection to connect to the books cache
ja_jp: 依存性注入を使用して書籍キャッシュに接続します。

source: Use either the `quarkus-container-image-docker` or `quarkus-container-image-podman` extension when doing things specific to either Docker or Podman, respectively.
ja_jp: DockerとPodmanのどちらかに特化した処理を行う場合は、それぞれ `quarkus-container-image-docker` または `quarkus-container-image-podman` エクステンションを使用してください。

source: Use encrypted configuration values to protect sensitive passwords, secrets, tokens and keys.
ja_jp: 暗号化された設定値を使用して、機密性の高いパスワード、シークレット、トークン、キーを保護してください。

source: Use existing Quarkus MicroMeter OTLP registry
ja_jp: 既存の Quarkus MicroMeter OTLP レジストリーの使用

source: Use https://code.quarkus.io/[code.quarkus.io] to generate an application with the following extensions, for Maven or Gradle:
ja_jp: https://code.quarkus.io/[code.quarkus.io] を使用して、Maven または Gradle 用に次のエクステンションを備えたアプリケーションを生成します。

source: Use inclusive authentication to enable path-based authentication
ja_jp: パスベースの認証を有効にするには、統合認証を使用します。

source: Use io_uring
ja_jp: io_uringを使用

source: Use last request path segment as tenant id
ja_jp: 最後のリクエストパスセグメントをテナント ID として使用する

source: Use log levels
ja_jp: ログレベルの使用

source: Use lower-case characters.
ja_jp: 小文字を使用してください。

source: Use multiple datasources in a single transaction
ja_jp: 単一のトランザクションで複数のデータソースを使用する

source: Use mutable jars to rebuild your application with different build time configurations.
ja_jp: 異なるビルド時設定でアプリケーションを再ビルドする為にmutable jarを使用

source: Use native transports
ja_jp: ネイティブ・トランスポートの使用

source: Use of @RunOnVirtualThread annotation on methods and classes
ja_jp: メソッドとクラスでの @RunOnVirtualThread アノテーションの使用

source: Use of nested static public classes
ja_jp: ネストされた静的パブリッククラスの使用

source: Use one of the following configuration examples based on your keystore type:
ja_jp: キーストアタイプに応じて、次のいずれかの設定例を使用してください。

source: Use one of the following methods to obtain a reference to a Meter:
ja_jp: メーターへの参照を取得するには、次のいずれかの方法を使用します。

source: Use one of the following methods to obtain a reference to a `MeterRegistry`:
ja_jp: `MeterRegistry` への参照を取得するには、次のいずれかの方法を使用します。

source: Use one of the following steps to go to the required {openshift} project:
ja_jp: 以下のいずれかの手順で、必要な {openshift} プロジェクトに移動します：

source: Use other logging APIs
ja_jp: 他のロギングAPIの使用

source: Use platform-specific install tools like https://sdkman.io/jdks#Oracle[sdkman], https://github.com/graalvm/homebrew-tap[homebrew], or https://github.com/ScoopInstaller/Java[scoop].
ja_jp: https://sdkman.io/jdks#Oracle[sdkman]、 https://github.com/graalvm/homebrew-tap[homebrew]、 https://github.com/ScoopInstaller/Java[scoop] など、プラットフォーム固有のインストールツールを使用してください。

source: Use platform-specific installer tools like https://sdkman.io/jdks#graalce[sdkman], https://github.com/graalvm/homebrew-tap[homebrew], or https://github.com/ScoopInstaller/Java[scoop]. We recommend the _community edition_ of GraalVM. For example, install it with `sdk install java 21-graalce`.
ja_jp: https://sdkman.io/jdks#graalce[sdkman]、 https://github.com/graalvm/homebrew-tap[homebrew]、 https://github.com/ScoopInstaller/Java[scoop] などのプラットフォーム固有のインストーラーツールを使用します。 GraalVM の _コミュニティーエディション_ が推奨されます。たとえば、 `sdk install java 21-graalce` でインストールします。

source: Use public fields. Get rid of dumb getter and setters. Hibernate ORM w/o Panache also doesn't require you to use getters and setters, but Panache will additionally generate all getters and setters that are missing, and rewrite every access to these fields to use the accessor methods. This way you can still write _useful_ accessors when you need them, which will be used even though your entity users still use field accesses. This implies that from the Hibernate perspective you're using accessors via getters and setters even while it looks like field accessors.
ja_jp: パブリックフィールドを使う。馬鹿げたゲッターとセッターを取り除きます。PanacheではないHibernate ORMでもゲッターとセッターを使う必要はありませんが、Panacheはさらに不足しているすべてのゲッターとセッターを生成し、これらのフィールドへのすべてのアクセスをアクセサメソッドを使うように書き換えます。このようにして必要なときに _有用な_ アクセサを書くことができ、エンティティユーザがフィールドアクセスを使用しているにもかかわらず、それが使用されます。これは、Hibernateの観点からはフィールドアクセサのように見えても、ゲッターとセッターを介してアクセサーを使用していることを意味します。

source: Use public fields. Get rid of dumb getter and setters. Under the hood, we will generate all getters and setters that are missing, and rewrite every access to these fields to use the accessor methods. This way you can still write _useful_ accessors when you need them, which will be used even though your entity users still use field accesses.
ja_jp: パブリックフィールドを使ってください。無駄なゲッターとセッターを無くせます。フードの下では、不足しているすべてのゲッターとセッターを生成し、これらのフィールドへのすべてのアクセスを、アクセサ・メソッドを使用するように書き換えます。この方法では、必要なときに _便利な_ アクセサを書くことができ、エンティティ・ユーザーがフィールド・アクセスを使用していても、それが使用されます。

source: Use request path segments to find tenant id
ja_jp: リクエストパスセグメントを使用してテナント ID を見つけます

source: Use runtime web dependencies such as https://mvnpm.org[mvnpm] or https://www.webjars.org[WebJars], when added to your pom.xml or build.gradle they can be directly xref:web-dependency-locator.adoc[accessed from your web pages].
ja_jp: https://mvnpm.org[mvnpm] や https://www.webjars.org[WebJars] などのランタイム Web 依存関係を使用します。pom.xml または build.gradle に追加すると、xref:web-dependency-locator.adoc[Web ページから直接アクセス] できるようになります。

source: Use standard security annotation to secure an HTTP upgrade
ja_jp: 標準のセキュリティーアノテーションを使用して HTTP アップグレードを保護する

source: Use stateless sessions
ja_jp: ステートレスセッションの使用

source: Use the <a href="https://github.com/quarkusio/quarkus/discussions">Discussions</a> section on our GitHub project.
ja_jp: GitHubプロジェクトの<a href="https://github.com/quarkusio/quarkus/discussions">Discussions</a>セクションをご利用ください。

source: Use the @RunOnVirtualThread annotation
ja_jp: @RunOnVirtualThread アノテーションの使用

source: Use the Basic authentication and authorize the requests with a custom `io.quarkus.vertx.http.runtime.security.HttpSecurityPolicy`.
ja_jp: Basic 認証を使用し、カスタムの `io.quarkus.vertx.http.runtime.security.HttpSecurityPolicy` でリクエストを認可します。

source: Use the Bearer token authentication and authorize the `SecurityIdentity` with your own policy.
ja_jp: ベアラー トークン認証を使用し、独自のポリシーで `SecurityIdentity` を認可します。

source: Use the Cluster Mode
ja_jp: クラスターモードの使用

source: Use the Event Bus
ja_jp: Event Busの使用

source: Use the Flyway instance directly
ja_jp: Flyway インスタンスの直接使用

source: Use the GitHub access token to access GitHub API
ja_jp: GitHub アクセストークンを使用して GitHub API にアクセスします。

source: Use the Infinispan backend
ja_jp: Infinispan バックエンドの使用

source: Use the KeyStore
ja_jp: KeyStoreの使用

source: Use the Kubernetes Client extension
ja_jp: Kubernetes クライアントエクステンションの使用

source: Use the Liquibase instance directly
ja_jp: Liquibaseのインスタンスの直接使用

source: Use the Load Shedding extension
ja_jp: 負荷制限エクステンションの使用

source: Use the MongoDB Dev Services
ja_jp: MongoDB Dev Services の使用

source: Use the Quarkus CLI command to add a new encrypted value or encrypt an existent value in `application.properties`:
ja_jp: QuarkusのCLIコマンドを使用して、 新しい暗号化された値を追加するか、 `application.properties` の既存の値を暗号化します：

source: Use the Quarkus CLI to create, build, run, and manage extensions for Quarkus projects.
ja_jp: Quarkus CLIを使用して、Quarkusプロジェクトのエクステンションを作成、ビルド、実行、管理します。

source: Use the Quarkus Maven plugin that will hook into the build process.
ja_jp: ビルドプロセスにフックするQuarkus Mavenプラグインを使用します。

source: Use the Quarkus OpenID Connect (OIDC) extension to secure a Jakarta REST application with Bearer token authentication.
ja_jp: Quarkus OpenID Connect（OIDC）エクステンションを使用して、Bearerトークン認証でJakarta RESTアプリケーションを保護します。

source: Use the Quarkus OpenID Connect (OIDC) extension to secure a Jakarta REST application with Bearer token authentication. The bearer tokens are issued by OIDC and OAuth 2.0 compliant authorization servers, such as link:https://www.keycloak.org[Keycloak].
ja_jp: Quarkus OpenID Connect (OIDC) エクステンションを使用して、Bearer トークン認証で Jakarta REST アプリケーションを保護します。 ベアラートークンは、OIDC および OAuth 2.0 準拠の認可サーバー (link:https://www.keycloak.org[Keycloak] など) によって発行されます。

source: Use the Quarkus Spring Data REST compatibility layer to create a sample CRUD application.
ja_jp: Quarkus Spring Data REST互換レイヤーを使用して、サンプルCRUDアプリケーションを作成します。

source: Use the Quarkus templates to ensure that your content is consistent with the preferred Quarkus documentation structure and style.
ja_jp: Quarkus テンプレートを使用して、推奨される Quarkus ドキュメントの構造とスタイルと、コンテンツが一致していることを確認します。

source: Use the Redis Client
ja_jp: Redisクライアントの使用

source: Use the Redis Dev Services
ja_jp: Redis Dev Servicesの使用

source: Use the Redis backend
ja_jp: Redisバックエンドの使用

source: Use the Replication Mode
ja_jp: レプリケーションモードの使用

source: Use the Sentinel Mode
ja_jp: Sentinel モードの使用

source: Use the Spring `@Scheduled` annotation with a cron-like expression to instruct Quarkus to schedule this method run. In this example we're scheduling a task to be executed at 10:15am every day.
ja_jp: Spring `@Scheduled` アノテーションをcronのような表現で使用し、Quarkusにこのメソッドの実行をスケジュールするよう指示します。この例では、毎日午前10時15分にタスクが実行されるようにスケジュールしています。

source: Use the Vale CLI
ja_jp: Vale CLIの使用

source: Use the Vert.x Web Client
ja_jp: Vert.xウェブクライアントの使用

source: Use the Vert.x redis client
ja_jp: Vert.x redisクライアントの使用

source: Use the `--help` option to display the options for creating projects:
ja_jp: プロジェクト作成オプションを表示するには、 `--help` オプションを使用します。

source: Use the `@AuthorizationPolicy` security annotation.
ja_jp: `@AuthorizationPolicy` セキュリティーアノテーションを使用します。

source: Use the `@ConsumeEvent` annotation to declare a consumer. It is possible to use the Vert.x API https://vertx.io/docs/vertx-core/java/#_acknowledging_messages_sending_replies[directly] too.
ja_jp: コンシューマを宣言するには、 `@ConsumeEvent` アノテーションを使用します。Vert.x API を link:https://vertx.io/docs/vertx-core/java/#_acknowledging_messages_sending_replies[直接] 使用することも可能です。

source: Use the `@Identifier` qualifier to indicate a named TLS configuration for which to provide keystore options. Omit the qualifier (or use `@Default` explicitly) to indicate the default TLS configuration. See <<referencing-a-tls-configuration>> for more details.
ja_jp: `@Identifier` 修飾子を使用して、キーストアオプションを提供する名前付き TLS 設定を指定します。修飾子を省略 (または明示的に `@Default` を使用) して、デフォルトの TLS 設定を指定します。詳細は、<<referencing-a-tls-configuration>> を参照してください。

source: Use the `@Identifier` qualifier to indicate a named TLS configuration for which to provide truststore options. Omit the qualifier (or use `@Default` explicitly) to indicate the default TLS configuration. See <<referencing-a-tls-configuration>> for more details.
ja_jp: `@Identifier` 修飾子を使用して、トラストストアオプションを提供する名前付き TLS 設定を指定します。修飾子を省略 (または明示的に `@Default` を使用) して、デフォルトの TLS 設定を指定します。詳細は、<<referencing-a-tls-configuration>> を参照してください。

source: Use the `@Identifier` qualifier to indicate the named TLS configuration that provides the keystore options. Omit the qualifier to indicate the default TLS configuration. You can also use `@Default` explicitly to indicate the default TLS configuration. For more information, see <<referencing-a-tls-configuration>>.
ja_jp: `@Identifier` 修飾子を使用して、キーストアオプションを提供する名前付き TLS 設定を指定します。デフォルトの TLS 設定を指定する場合は、修飾子を省略します。`@Default` を明示的に使用してデフォルトの TLS 設定を指定することもできます。詳細は、<<referencing-a-tls-configuration>> を参照してください。

source: Use the `@Identifier` qualifier to indicate the named TLS configuration that provides the truststore options. Omit the qualifier to indicate the default TLS configuration. You can also use `@Default` explicitly to indicate the default TLS configuration. For more information, see <<referencing-a-tls-configuration>>.
ja_jp: `@Identifier` 修飾子を使用して、トラストストアオプションを提供する名前付き TLS 設定を指定します。デフォルトの TLS 設定を指定する場合は、修飾子を省略します。`@Default` を明示的に使用してデフォルトの TLS 設定を指定することもできます。詳細は、<<referencing-a-tls-configuration>> を参照してください。

source: Use the `@IfBuildProfile("my-profile")` on the CDI beans containing `@Incoming(channel)` and `@Outgoing(channel)` annotations that need only to be enabled when the profile is enabled.
ja_jp: プロファイルが有効な場合にのみ有効にする必要がある `@Incoming(channel)` と `@Outgoing(channel)` アノテーションを含む CDI Bean で、 `@IfBuildProfile("my-profile")` を使用します。

source: Use the `@InfinispanClientName` qualifier with dependency injection:
ja_jp: 依存性注入では `@InfinispanClientName` という修飾子を使います：

source: Use the `@Remote` annotation to use a cache. If the cache does not exist, will be created with a default configuration *on first access*.
ja_jp: キャッシュを使用するには、 `@Remote` アノテーションを使用します。キャッシュが存在しない場合、 *初回アクセス時に* デフォルトの設定で作成されます。

source: Use the `@Scheduled` annotation to instruct Quarkus to execute this method on the half hour. For more information see the xref:scheduler.adoc[Scheduler] guide.
ja_jp: `@Scheduled` アノテーションを使用して、Quarkusにこのメソッドを30分毎に実行するよう指示します。詳細については、 link:scheduler[スケジューラーガイド] を参照してください。

source: Use the `@Scheduled` annotation to instruct Quarkus to run this method every 10 seconds and set the unique identifier for this job.
ja_jp: `@Scheduled` アノテーションを使用し、このメソッドを10秒ごとに実行し、識別子を付与するようにQuarkusに指示します。

source: Use the `@Scheduled` annotation to instruct Quarkus to run this method every 10 seconds provided a worker thread is available (Quarkus is using 10 worker threads for the scheduler). If it is not available the method invocation should be re-scheduled by default i.e it should be invoked as soon as possible. The invocation of the scheduled method does not depend on the status or result of the previous invocation.
ja_jp: `@Scheduled` アノテーションを使用して、ワーカースレッドが利用可能であれば 10 秒ごとにこのメソッドを実行するように Quarkus に指示します (Quarkus はスケジューラーに10個のワーカースレッドを使用しています)。ワーカースレッドが利用できない場合は、メソッドの呼び出しをデフォルトで再スケジューリングする必要があります。スケジュールされたメソッドの呼び出しは、前回の呼び出しのステータスや結果には依存しません。

source: Use the `@Scheduled` annotation to instruct Quarkus to run this method every 10 seconds provided a worker thread is available (Quarkus is using 10 worker threads for the scheduler). If it is not available the method invocation should be re-scheduled by default i.e. it should be invoked as soon as possible. The invocation of the scheduled method does not depend on the status or result of the previous invocation.
ja_jp: `@Scheduled` アノテーションを使用して、ワーカースレッドが利用可能であれば 10 秒ごとにこのメソッドを実行するように Quarkus に指示します (Quarkus はスケジューラーに10個のワーカースレッドを使用しています)。ワーカースレッドが利用できない場合は、メソッドの呼び出しをデフォルトで再スケジューリングする必要があります。スケジュールされたメソッドの呼び出しは、前回の呼び出しのステータスや結果には依存しません。

source: Use the `Log` API only in application classes, not in external dependencies. `Log` method calls not processed by Quarkus at build time will result in an exception.
ja_jp: `Log` API は外部依存関係ではなく、アプリケーションクラスでのみ使用してください。 ビルド時に Quarkus によって処理されない `Log` メソッド呼び出しは例外になります。

source: Use the `MDC` class to set the data.
ja_jp: `MDC` クラスを使ってデータをセットします。

source: Use the `ServiceLoader` mechanism by creating a `META-INF/services/io.smallrye.jwt.auth.principal.JWTCallerPrincipalFactory` resource.
ja_jp: `META-INF/services/io.smallrye.jwt.auth.principal.JWTCallerPrincipalFactory` リソースを作成して、 `ServiceLoader` メカニズムを使用します。

source: Use the `addPage` method.
ja_jp: `addPage` メソッドを使用します。

source: Use the `data` namespace to access the `item` data object.
ja_jp: `data` 名前空間を使用して、 `item` データ・オブジェクトにアクセスします。

source: Use the `devServicesConfig` RPC method from the namespace `devui-dev-services`.
ja_jp: 名前空間 `devui-dev-services` から `devServicesConfig` RPC メソッドを使用します。

source: Use the `invoke` command to invoke your function.
ja_jp: Function を呼び出すには `invoke` コマンドを使用します。

source: Use the `io.quarkus.vertx.SafeVertxContext` annotation
ja_jp: `io.quarkus.vertx.SafeVertxContext` アノテーションを使用します。

source: Use the `io.quarkus.vertx.core.runtime.context.VertxContextSafetyToggle` class
ja_jp: `io.quarkus.vertx.core.runtime.context.VertxContextSafetyToggle` クラスを使用します。

source: Use the `org.jboss.resteasy.annotations.jaxrs.QueryParam` annotation type to avoid repeating the parameter name.
ja_jp: パラメータ名の繰り返しを避けるため、 `org.jboss.resteasy.annotations.jaxrs.QueryParam` アノテーション型を使用します。

source: Use the `org.jboss.resteasy.reactive.RestQuery` annotation type to avoid repeating the parameter name.
ja_jp: パラメーター名の繰り返しを避けるために `org.jboss.resteasy.annotations.jaxrs.QueryParam` アノテーションを使用します。

source: Use the `quarkus-keycloak-authorization` extension only if you are using Keycloak and Keycloak Authorization Services is enabled in your environment to handle authorization decisions.
ja_jp: Keycloak を使用しており、認可決定を処理するために環境で Keycloak Authorization Services が有効になっている場合にのみ、 `quarkus-keycloak-authorization` エクステンションを使用します。

source: Use the `quarkus-keycloak-authorization` extension only if you are using Keycloak and the Keycloak Authorization Services feature is enabled in your environment to handle authorization decisions.
ja_jp: Keycloak を使用しており、認可判断を処理するために環境で Keycloak 認可サービス機能が有効になっている場合にのみ、`quarkus-keycloak-authorization` エクステンションを使用してください。

source: Use the `quarkus.micrometer.binder.http-server.match-patterns` property if the correct URL can not be determined. This property accepts a comma-separated list defining an association between a simple regex match pattern and a replacement string. For example, setting `quarkus.micrometer.binder.http-server.match-patterns=/example/prime/[0-9]+=/example/{jellybeans}` would use the value `/example/{jellybeans}` for the uri attribute any time the requested uri matches `/example/prime/[0-9]+`.
ja_jp: 正しいURLが特定できない場合は、 `quarkus.micrometer.binder.http-server.match-patterns` プロパティを使用します。このプロパティには、単純な正規表現パターンと置換文字列の関連性を定義するコンマ区切りのリストを指定できます。例えば、 `quarkus.micrometer.binder.http-server.match-patterns=/example/prime/[0-9]+=/example/{jellybeans}` を設定すると、要求された uri が `/example/prime/[0-9]+` に一致した場合、uri 属性に `/example/{jellybeans}` の値が使用されます。

source: Use the `quarkus.oidc.authentication.cookie-path` property to ensure that the same cookie is visible when you access protected resources with overlapping or different roots. For example:
ja_jp: `quarkus.oidc.authentication.cookie-path` プロパティーを使用すると、保護されたリソースに重複または異なるルートでアクセスしたときに、同じクッキーが表示されるようになります。 例:

source: Use the `quarkusShowEffectiveConfig` task to show the effective configuration options used for a Quarkus build. If you specify the `--save-config-properties` command line option, the configuration properties are also store in the file `build/<final-name>.quarkus-build.properties`.
ja_jp: Quarkus のビルドに使用される有効な設定オプションを表示するには、 `quarkusShowEffectiveConfig` タスクを使用します。 `--save-config-properties` コマンドラインオプションを指定すると、設定プロパティは `build/<final-name>.quarkus-build.properties` ファイルにも保存されます。

source: Use the `quarkus` packaging instead of the default `jar` packaging.
ja_jp: デフォルトの `jar` パッケージングの代わりに `quarkus` パッケージングを使用します。

source: Use the `quay.io/quarkus/ubi-quarkus-graalvmce-builder-image:{graalvm-flavor}` docker image introduced in <<#multistage-docker,Using a multi-stage Docker build>> to build the native image.
ja_jp: <<#multistage-docker,マルチステージDockerビルドの使用>> で紹介された `quay.io/quarkus/ubi-quarkus-graalvmce-builder-image:{graalvm-flavor}` docker イメージを使用して、ネイティブイメージをビルドします。

source: Use the `quay.io/quarkus/ubi-quarkus-native-image:{graalvm-flavor}` docker image introduced in <<#multistage-docker,Using a multi-stage Docker build>> to build the native image.
ja_jp: <<#multistage-docker,マルチステージDockerビルドの使用>> で導入された `quay.io/quarkus/ubi-quarkus-native-image:{graalvm-flavor}` docker イメージを使用して、ネイティブイメージをビルドします。

source: Use the `quteDataPageBuilder`.
ja_jp: `quteDataPageBuilder` を使用します。

source: Use the `rawDataPageBuilder`.
ja_jp: `rawDataPageBuilder` を使用します。

source: Use the `received` method on `beverages` channel to check the messages produced by the application.
ja_jp: `beverages` チャンネルで `received` メソッドを使用して、アプリケーションによって生成されたメッセージを確認します。
